app/controllers/users_controller.rb

    def update
        # @user = User.find(params[:id])
        if @user.update_attributes(params[:user])
---
UPDATE "users" SET "name" = 'New Name', "email" = 'new@example.com', "password_digest" = '$2a$04$5VAdDf8dYRFraDhFWL81xeA6xvd6eGwuJ91dhuCxg8/7VJCEWoiCi', "remember_token" = 'dA8ifnZtFWML3fkNeI68Ig', "updated_at" = '2012-05-03 21:46:27.015140' WHERE "users"."id" = 1